[
    {
        "name": "Assistant Teacher Child Care Early Childhood Education",
        "location": "The Goddard School of Fairfield (Little Falls Road), Fairfield, NJ 07004",
        "description": "They are looking for part-time & full-time assistant teachers to join our team today to work in all of our age groups from Pre-K to infants in a support role called All School Assistant.",
        "pay": "$16-$17 an hour",
        "jobType": "Full-time",
        "benefits": [
            "Continuing education credits",
            "Dental insurance",
            "Food provided",
            "Health insurance",
            "Opportunities for advancement",
            "Paid time off",
            "Paid training",
            "Tuition reimbursement"
        ],
        "requirements": "Experience working with children under the age of 5 in a large group environment. Post-high school education is a plus! Shows empathy and compassion for young children. Is dependable and adaptable and enjoys working together toward a common goal. Must be able to lift up to 50 lbs. For Infant and Young Toddler Teachers, must be able to properly lift infants into and out of a crib.",
        "category": "Education",
        "id": 1000,
        "image": "apple",
        "applicationStatus": "Not Applied"
    },
    {
        "name": "Lifeguard",
        "location": "Meadowlands Area YMCA",
        "description": "Maintains safe swimming conditions in the pool, deck, and surrounding areas. Creates a safe and positive atmosphere that promotes member safety and engagement in accordance with YMCA policies and procedures. Lifeguard hours are needed during all open hours of the facility, weekdays 5 am-10 pm and weekends 7 am-7 pm.",
        "pay": "$13-$18 per hour",
        "jobType": "Part-time",
        "benefits": [
            "Employee discount",
            "Flexible schedule"
        ],
        "requirements": "Minimum age of 16. Certifications: CPR for the Professional Rescuer, AED, and Basic First Aid. Current Red Cross or YMCA Lifeguard certification. Ability to maintain certification-level of physical and mental readiness. Must demonstrate lifeguard skills in accordance with YMCA standards. Must be able to remain alert and see and observe all sections of an assigned zone or area of responsibility.",
        "category": "Safety",
        "id": 1001,
        "image": "apple",
        "applicationStatus": "Not Applied"
    },
    {
        "name": "Sales Associate/Stock (Adidas)",
        "location": "55 Parsonage Road, Edison, NJ 08837",
        "description": "We are calling all Store Associates who don’t accept what 'was' or what 'is,' but those who want to create what will be, and who share our desire to make a difference. We believe sport has the power to change lives. To bring this mission to life, we foster a culture centered on creativity, confidence, and collaboration.",
        "pay": "$14-$16 per hour",
        "jobType": "Part-time",
        "benefits": [
            "Employee discount",
            "Flexible schedule",
            "Paid time off",
            "Tuition reimbursement"
        ],
        "requirements": "Availability must be flexible and include evenings and weekends. Hours are part-time and will vary based on business needs. You must have or be pursuing a high school diploma or GED. Three to six months of experience working in a retail environment preferred. Basic numeracy, literacy, and verbal communication skills required. Must be 16 years of age or older. The employee must frequently lift and/or move up to 25 pounds and occasionally up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, and the ability to adjust focus.",
        "category": "Retail",
        "id": 1002,
        "image": "apple",
        "applicationStatus": "Not Applied"
    },
    {
        "name": "Rutgers Parking Attendant",
        "location": "83 Rockefeller Road, Piscataway, NJ",
        "description": "RU Big Ten Football Parking Attendants/Cashiers Needed! Part-time, Overtime after 40 hours. Kick the football season off by working at the birthplace of college football in Piscataway, NJ, and earn an extra paycheck.",
        "pay": "$18 an hour",
        "jobType": "Part-time, temporary",
        "benefits": ["N/A","N/A"],
        "requirements": "Must have the ability to communicate effectively with great customer service skills. Must be able to work in a variety of weather. Must be able to do simple math if cashier. Greet all patrons attending football games. Must wear a proper uniform (i.e. Plain White Polo, with Khaki pants). Screen for various parking passes.",
        "category": "Parking",
        "id": 1003,
        "image": "apple",
        "applicationStatus": "Not Applied"
    },
    {
        "name": "Program Assistant - Birthday Parties",
        "location": "13 Jefferson Ave, Maplewood, NJ 07040",
        "description": "We are an all-inclusive organization joined together by a shared commitment to nurturing the potential of kids, promoting healthy living, and fostering a sense of social responsibility. The Metro YMCA of the Oranges has an exciting opportunity for a highly motivated, mission-driven candidate to join our team.",
        "pay": "Not given, must ask in person",
        "jobType": "Part-time",
        "benefits": ["N/A","N/A"],
        "requirements": "High school student or equivalent. Previous experience working with children. At least 15 years of age. Previous experience with diverse populations preferred.",
        "category": "Assistant",
        "id": 1004,
        "image": "apple",
        "applicationStatus": "Not Applied"
    },
    {
        "name": "Tropical Smoothie Café Crew Member",
        "location": "Freehold, NJ 07728",
        "description": "Responsibilities: Deliver the Ultimate Guest service experience! Prepare orders in a timely and accurate manner. Work well with crew members and managers.",
        "pay": "$15.13 an hour",
        "jobType": "Full-time, Part-time",
        "benefits": [
            "Employee discount",
            "Flexible schedule",
            "Opportunities for advancement"
        ],
        "requirements": "Follow the highest food safety standards and regulations. Train quickly and work efficiently. Previous quick serve or restaurant experience a plus. Flexible availability. Rotating weekend shifts are required. Must be 16 years or older.",
        "category": "Retail",
        "id": 1005,
        "image": "apple",
        "applicationStatus": "Interview"
    },
    {
        "name": "Hospitality Team Member Evening Part-time (Chick-fil-A)",
        "location": "287 US 202, Flemington, NJ 08822",
        "description": "As a Front of House (Hospitality) Team Member, you will welcome & greet guests, take customer orders at either the front counter or drive-thru, prepare beverages & desserts, assemble and serve orders, maintain cleanliness, observe health and sanitation guidelines, and ensure each guest leaves with a smile! We are looking for friendly, enthusiastic people who enjoy serving customers. We will teach you everything else you need to know!",
        "pay": "$15.50 per hour",
        "jobType": "Part-time",
        "benefits": [
            "401(k) matching",
            "Employee discount",
            "Flexible schedule",
            "Health insurance",
            "Leadership training provided"
        ],
        "requirements": "Must be at least 16 years of age upon hire date. Must be eligible to work in the United States. Must have a source of reliable transportation. Ability to handle all equipment, navigating shelving both high and low. Reading, writing, and basic math and verbal communication skills required. Must work well under pressure. Must be able to respond to changes or edits to orders quickly and efficiently. Must be available a minimum of 20 hours per week, with the ability to close until 10:45 pm, Mon-Sat, with at least 2 Saturday evenings per month.",
        "category": "Retail",
        "id": 1006,
        "image": "apple",
        "applicationStatus": "Offer"
    },
    {
        "name": "Student Aide",
        "location": "Madison Area YMCA",
        "description": "The F.M. Kirby Children's Center of the Madison Area YMCA is looking for part-time Student Aides to work in our classrooms. Student Aides assist classroom teachers to implement the Center's development program, maintain classroom and joint-use space, and assist in supervising and engaging with the children.",
        "pay": "$15.13 - $16.00 per hour",
        "jobType": "Part-time",
        "benefits": [
            "Teaching experience"
        ],
        "requirements": "Minimum of 14 years old. Must be able to work well with young children, parents, and staff and display strong customer service-related skills. Must be certified (or agree to be trained) in CPR, First Aid, AED & oxygen certifications.",
        "category": "Assistant",
        "id": 1007,
        "image": "apple",
        "applicationStatus": "Not Applied"
    },
    {
        "name": "Philly Pretzel Factory Helper",
        "location": "35 Hazlet Avenue, Hazlet, NJ 07730",
        "description": "Looking to Hire Awesome People. Need General Helpers. Earn $15 to $18 an hour! INCLUDING BONUSES & GREAT TIPS! Hiring Full Timers First. MUST BE 16 OR OLDER TO APPLY! For IMMEDIATE CONSIDERATION stop into the Philly Pretzel Factory. If you feel you're Responsible and Reliable, we want to WORK WITH YOU!!! Please apply in Person.",
        "pay": "$15 to $18 an hour",
        "jobType": "Full-time",
        "benefits": [
            "Bonuses",
            "Great tips"
        ],
        "requirements": "Must be 16 years of age or older. Must be responsible and reliable.",
        "category": "Retail",
        "id": 1008,
        "image": "apple",
        "applicationStatus": "Interview"
    }
]
